{
	"name": "Toggle",
	"tagName": "x-toggle",
	"version": "0.2.9",
	"author": "Daniel Buchner",
	"description": "A polyfill merging radiobutton/checkbox inputs into a single tag to provide a consistent UI and simplify markup. Automatically switches between radiobutton and checkbox depending on name attribute.",
	"demo": "demo/testpage.html",
	"categories": [
		"input"
	],
	"compatibility": {
		"firefox": 5,
		"chrome": 4,
		"ie": 9,
		"opera": 12,
		"android": 2.1,
		"ios": 4
	},
	"documentation": {
		"description": "A polyfill merging radiobutton/checkbox inputs into a single tag to provide a consistent UI and simplify markup. Automatically switches between radiobutton and checkbox depending on name attribute.",
		"attributes": {
			"no-box": "If set, hides the polyfill's checkbox/radio button.",
			"label": "Contains the raw HTML string to render as the toggle's label.",
			"name": "Handles the name of the input. Follows the same rules as radio/checkbox input naming, and is required for form submissions to see the input. Multiple <x-toggle>s with the same name automatically become radio buttons.",
			"value": "Handles the input's value. Acts the same as any other <input> tag's value, and is submitted in forms.",
			"group": "Checkboxes with the same group can be range-toggled by holding down the shift key while toggling checkboxes",
			"active": "Indicates whether or not the toggle is the currently active toggle in of its group, if it has one.",
			"checked": "Indicates whether the toggle is checked or not"
		},
		"events": {},
		"methods": {},
		"getters": {
			"groupToggles": "Returns a list of all toggles sharing the same group",
			"noBox": "Returns the value of the no-box attribute",
			"label": "Returns the value of the label attribute",
			"name": "Returns the value of the name attribute",
			"group": "Returns the value of the group attribute",
			"active": "Returns the value of the active attribute",
			"checked": "Returns the value of the checked attribute"
		},
		"setters": {
			"noBox": "Sets the value of the no-box attribute",
			"label": "Sets the value of the label attribute",
			"name": "Sets the value of the name attribute",
			"group": "Sets the value of the group attribute",
			"active": "Sets the value of the active attribute",
			"checked": "Sets the value of the checked attribute"
		}
	}
}